# coding=utf8
import psycopg2
import random
import time


conn = psycopg2.connect("dbname='sith_db' user='postgres' password='Lovunod2302' host='localhost' port='5432'")
cur = conn.cursor()
names = ['Азамат', 'Азат', 'Александр', 'Алексей', 'Альберт', 'Анатолий', 'Андрей', 'Антон', 'Артём', 'Аркадий', 'Арсений', 'Артур', 'Богдан', 'Борис', 'Валерий', 'Валентин', 'Василий', 'Вадим', 'Владимир', 'Владислав', 'Виктор', 'Виталий', 'Вячеслав', 'Григорий', 'Глеб', 'Герман', 'Георгий', 'Геннадий', 'Давид', 'Даниил', 'Дмитрий', 'Денис', 'Евгений', 'Егор', 'Захар', 'Иван', 'Игорь', 'Ильдар', 'Илья', 'Кирилл', 'Константин', 'Леонид', 'Марат', 'Марк', 'Максим', 'Михаил', 'Назар', 'Никита', 'Николай', 'Олег', 'Павел', 'Пётр', 'Рашид', 'Ринат', 'Роберт', 'Роман', 'Руслан', 'Рустам', 'Святослав', 'Станислав', 'Степан', 'Сергей', 'Семён', 'Тарас', 'Тимофей', 'Филипп', 'Фёдор', 'Эрик', 'Эльдар', 'Эмиль', 'Эдуард', 'Юрий', 'Ярослав', 'Яков']
surnames = ["Абрамов", "Авдеев", "Агафонов", "Аксёнов", "Александров", "Алексеев", "Андреев", "Анисимов", "Антонов", "Артемьев", "Архипов", "Афанасьев", "Баранов", "Белов", "Белозёров", "Белоусов", "Беляев", "Беляков", "Беспалов", "Бирюков", "Блинов", "Блохин", "Бобров", "Бобылёв", "Богданов", "Большаков", "Борисов", "Брагин", "Буров", "Быков", "Васильев", "Веселов", "Виноградов", "Вишняков", "Владимиров", "Власов", "Волков", "Воробьёв", "Воронов", "Воронцов", "Гаврилов", "Галкин", "Герасимов", "Голубев", "Горбачёв", "Горбунов", "Гордеев", "Горшков", "Григорьев", "Гришин", "Громов", "Гуляев", "Гурьев", "Гусев", "Гущин", "Давыдов", "Данилов", "Дементьев", "Денисов", "Дмитриев", "Доронин", "Дорофеев", "Дроздов", "Дьячков", "Евдокимов", "Евсеев", "Егоров", "Елисеев", "Емельянов", "Ермаков", "Ершов", "Ефимов", "Ефремов", "Жданов", "Жуков", "Журавлёв", "Зайцев", "Захаров", "Зимин", "Зиновьев", "Зуев", "Зыков", "Иванков", "Иванов", "Игнатов", "Игнатьев", "Ильин", "Исаев", "Исаков", "Кабанов", "Казаков", "Калашников", "Калинин", "Капустин", "Карпов", "Кириллов", "Киселёв", "Князев", "Ковалёв", "Козлов", "Колесников", "Колобов", "Комаров", "Комиссаров", "Кондратьев", "Коновалов", "Кононов", "Константинов", "Копылов", "Корнилов", "Королёв", "Костин", "Котов", "Кошелев", "Красильников", "Крылов", "Крюков", "Кудрявцев", "Кудряшов", "Кузнецов", "Кузьмин", "Кулагин", "Кулаков", "Куликов", "Лаврентьев", "Лазарев", "Лапин", "Ларионов", "Лебедев", "Лихачёв", "Лобанов", "Логинов", "Лукин", "Лыткин", "Макаров", "Максимов", "Мамонтов", "Марков", "Мартынов", "Маслов", "Матвеев", "Медведев", "Мельников", "Меркушев", "Миронов", "Михайлов", "Михеев", "Мишин", "Моисеев", "Молчанов", "Морозов", "Муравьёв", "Мухин", "Мышкин", "Мясников", "Назаров", "Наумов", "Некрасов", "Нестеров", "Никитин", "Никифоров", "Николаев", "Никонов", "Новиков", "Носков", "Носов", "Овчинников", "Одинцов", "Орехов", "Орлов", "Осипов", "Павлов", "Панов", "Панфилов", "Пахомов", "Пестов", "Петров", "Петухов", "Поляков", "Пономарёв", "Попов", "Потапов", "Прохоров", "Рогов", "Родионов", "Рожков", "Романов", "Русаков", "Рыбаков", "Рябов", "Савельев", "Савин", "Сазонов", "Самойлов", "Самсонов", "Сафонов", "Селезнёв", "Селиверстов", "Семёнов", "Сергеев", "Сидоров", "Силин", "Симонов", "Ситников", "Соболев", "Соколов", "Соловьёв", "Сорокин", "Степанов", "Стрелков", "Субботин", "Суворов", "Суханов", "Сысоев", "Тарасов", "Терентьев", "Тетерин", "Тимофеев", "Титов", "Тихонов", "Третьяков", "Трофимов", "Туров", "Уваров", "Устинов", "Фадеев", "Фёдоров", "Федосеев", "Федотов", "Филатов", "Филиппов", "Фокин", "Фомин", "Фомичёв", "Фролов", "Харитонов", "Хохлов", "Цветков", "Чернов", "Шарапов", "Шаров", "Шашков", "Шестаков", "Шилов", "Ширяев", "Шубин", "Щербаков", "Щукин", "Юдин", "Яковлев", "Якушев", "Смирнов"]
patronimics = ["Александрович", "Алексеевич", "Анатольевич", "Андреевич", "Антонович", "Аркадьевич", "Арсеньевич", "Артемович", "Афанасьевич", "Вадимович", "Валентинович", "Валериевич", "Васильевич", "Викторович", "Витальевич", "Владимирович", "Всеволодович", "Вячеславович", "Давыдович", "Данилович", "Денисович", "Дмитриевич", "Кириллович", "Константинович", "Корнеевич", "Леонидович", "Львович", "Евгеньевич", "Егорович", "Емельянович", "Ефимович", "Гаврилович", "Геннадиевич", "Георгиевич", "Глебович", "Григорьевич", "Богданович", "Борисович", "Назарович", "Наумович", "Николаевич", "Робертович", "Родионович", "Романович", "Тарасович", "Тимофеевич", "Тихонович", "Савельевич", "Семенович", "Сергеевич", "Станиславович", "Степанович"]
i = 1
symbols = ['a', 'b', 'c', 'd', 'e', 'f', 'h', 'y', 'k', 'q', 'r', 'z']


def req():
    for i in range(100):
        name = "{} {} {}".format(random.choice(surnames), random.choice(names), random.choice(patronimics))
        planet = random.randint(1, 3)
        age = random.randint(18, 50)
        email = random.choice(symbols)+random.choice(symbols)+random.choice(symbols)+random.choice(symbols)+str(random.randint(100, 999))+'@gmail.com'
        cur.execute("insert into recruit (name, planet, age, email) values ('{}', {}, {}, '{}')".format(name, planet, age, email))
        conn.commit()



def plan():
    pla = ['Юпитер', "Эндор", "Энцелад", "Земля"]
    for i in pla:
        cur.execute(
            "insert into planets (name) values ('{}')".format(i))
        conn.commit()


def q_list():
    cur.execute("insert into question_lists (test, question) values (1, 1), (1, 2), (1, 3), (2, 1), (2, 2), (2, 4)")
    conn.commit()


def qs():
    cur.execute("insert into questions (question) values ('Хорошее настроение?'), ('Хотите помочь правому делу?'), ('Имеете страховку?'), ('Нравится сайт?')")
    conn.commit()


def master():
    name = ["Палпатин", "Дарт Вективус", "Дарт Гин", "Дарт Бэйн"]
    for item in name:
        planet = random.randint(1, 3)
        cur.execute(
            "insert into sith (name, ed_planet) values ('{}', {})".format(item, planet))
        conn.commit()


def answers():
    for i in range(100):
        answer = "Вопрос 1) "+random.choice(["Да", "Нет"]) + ", Вопрос 2) "+random.choice(["Да", "Нет"]) + ", Вопрос 3) "+random.choice(["Да", "Нет"])
        cur.execute("insert into answers (rec_id, answer) values ({}, '{}')".format(i, answer))
        conn.commit()


def sh():
    cur.execute("insert into shadow_hands (req_id, master_id) values (3, 1), (6, 1), (8, 1), (12, 2), (16, 2), (4, 25), (4, 66), (4, 88)")
    conn.commit()


def sith():
    cur.execute(
        "insert into sith (name, ed_planet) values ('Палпатин', 3), ('Дарт Вективус', 2), ('Дарт Гин', 1), ('Дарт Бэйн', 2)")
    conn.commit()

def tes():
    cur.execute(
        "insert into tests (orden_num) values (66), (15)")
    conn.commit()


qs()
plan()
tes()
q_list()
req()
sith()
answers()
sh()

